#Использовать entity

&Деталька(Значение = "litros.ПутьКБД", ЗначениеПоУмолчанию = "./litros.db") 
Перем _ПутьКБД; // Число

&Дуб
Процедура ПриСозданииОбъекта()
КонецПроцедуры

&Завязь(Тип = "МенеджерСущностей")
Функция МенеджерСущностей() Экспорт

	МенеджерСущностей = Новый МенеджерСущностей(Тип("КоннекторSQLite"), СтрШаблон("Data Source=%1;", _ПутьКБД));
	МенеджерСущностей.ДобавитьКлассВМодель(Тип("СущностьОчередьПакета"));
	МенеджерСущностей.ДобавитьКлассВМодель(Тип("СущностьСтатистикаПакета"));

	Попытка
		МенеджерСущностей.Инициализировать();
	Исключение
		ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат МенеджерСущностей;

КонецФункции