// BSLLS:MissingVariablesDescription-off
// BSLLS:ExportVariables-off

&Деталька(Значение = "litros.db.ТаймаутЗанятостиМс", ЗначениеПоУмолчанию = 1000)
Перем ТаймаутЗанятостиМс Экспорт;

&Деталька(Значение = "litros.db.МаксимальноеОжиданиеСлотаМс", ЗначениеПоУмолчанию = 10000)
Перем МаксимальноеОжиданиеСлотаМс Экспорт;

&Деталька(Значение = "litros.db.МаксимальноеОжиданиеЗакрытияМс", ЗначениеПоУмолчанию = 30000)
Перем МаксимальноеОжиданиеЗакрытияМс Экспорт;

&Деталька(Значение = "litros.db.КоличествоЧитателей", ЗначениеПоУмолчанию = 0)
Перем КоличествоЧитателей Экспорт;

&Деталька(Значение = "litros.db.КоличествоПисателей", ЗначениеПоУмолчанию = 0)
Перем КоличествоПисателей Экспорт;

&Деталька(Значение = "litros.db.ИспользоватьWAL", ЗначениеПоУмолчанию = Истина)
Перем ИспользоватьWAL Экспорт;

#Область ОбработчикиСобытий

&Желудь
Процедура ПриСозданииОбъекта()

	ТаймаутЗанятостиМс = 1000;
	МаксимальноеОжиданиеСлотаМс = 10000;
	МаксимальноеОжиданиеЗакрытияМс = 30000;
	КоличествоЧитателей = 0;
	КоличествоПисателей = 0;
	ИспользоватьWAL = Истина;

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция РассчитатьКоличествоПисателей(КоличествоПроцессоров) Экспорт

	ПроверитьНастройки(КоличествоПроцессоров);
	Если КоличествоПисателей > 0 Тогда
		Возврат КоличествоПисателей;
	КонецЕсли;

	Возврат Макс(1, Мин(4, Цел(КоличествоПроцессоров / 4)));

КонецФункции

Функция РассчитатьКоличествоЧитателей(КоличествоПроцессоров) Экспорт

	ПроверитьНастройки(КоличествоПроцессоров);
	Если КоличествоЧитателей > 0 Тогда
		Возврат КоличествоЧитателей;
	КонецЕсли;

	КоличествоПисателейПоУмолчанию = Макс(1, Мин(4, Цел(КоличествоПроцессоров / 4)));
	Возврат Макс(2, Мин(32, КоличествоПроцессоров - КоличествоПисателейПоУмолчанию));

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьНастройки(КоличествоПроцессоров)

	ПроверитьЦелоеЧислоВДиапазоне(КоличествоПроцессоров, 1, 2147483647, "Количество процессоров");
	ПроверитьЦелоеЧислоВДиапазоне(ТаймаутЗанятостиМс, 0, 2147483647, "Настройка litros.db.ТаймаутЗанятостиМс");
	ПроверитьЦелоеЧислоВДиапазоне(МаксимальноеОжиданиеСлотаМс, 0, 2147483647, "Настройка litros.db.МаксимальноеОжиданиеСлотаМс");
	ПроверитьЦелоеЧислоВДиапазоне(МаксимальноеОжиданиеЗакрытияМс, 1, 2147483647, "Настройка litros.db.МаксимальноеОжиданиеЗакрытияМс");
	ПроверитьЦелоеЧислоВДиапазоне(КоличествоЧитателей, 0, 2147483647, "Настройка litros.db.КоличествоЧитателей");
	ПроверитьЦелоеЧислоВДиапазоне(КоличествоПисателей, 0, 2147483647, "Настройка litros.db.КоличествоПисателей");

КонецПроцедуры

Процедура ПроверитьЦелоеЧислоВДиапазоне(Значение, Минимум, Максимум, Имя)

	Если ТипЗнч(Значение) <> Тип("Число")
		Или Цел(Значение) <> Значение
		Или Значение < Минимум
		Или Значение > Максимум Тогда

		ВызватьИсключение СтрШаблон("%1 должно быть целым числом от %2 до %3", Имя, Минимум, Максимум);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
