#Использовать "../../../src/dto"

Перем _ДоступыКБД; // Массив
Перем _КоличествоОшибок; // Число
Перем _ОписаниеОшибки; // Строка
Перем _Аргументы; // Массив

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()
	_ДоступыКБД = Новый Массив();
	_КоличествоОшибок = 0;
	_ОписаниеОшибки = "";
	_Аргументы = Новый Массив();
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура НастроитьОшибки(КоличествоОшибок, ОписаниеОшибки) Экспорт
	_КоличествоОшибок = КоличествоОшибок;
	_ОписаниеОшибки = ОписаниеОшибки;
КонецПроцедуры

Функция СохранитьИВернуть(ДоступКБД, Первый = Неопределено, Второй = Неопределено) Экспорт
	_ДоступыКБД.Добавить(ДоступКБД);
	_Аргументы.Добавить(Первый);
	_Аргументы.Добавить(Второй);
	ДоступКБД.Сохранить(Новый СущностьРепозиторий());
	Если _ДоступыКБД.Количество() <= _КоличествоОшибок Тогда
		ВызватьИсключение _ОписаниеОшибки;
	КонецЕсли;
	Возврат "результат транзакции";
КонецФункции

Функция ДоступКБД(Индекс) Экспорт
	Возврат _ДоступыКБД[Индекс];
КонецФункции

Функция КоличествоПопыток() Экспорт
	Возврат _ДоступыКБД.Количество();
КонецФункции

Функция Аргумент(Индекс) Экспорт
	Возврат _Аргументы[Индекс];
КонецФункции

#КонецОбласти
