#Использовать "../../../src/dto"

Перем _ЕдиницыРаботы; // Массив
Перем _КоличествоОшибок; // Число
Перем _ОписаниеОшибки; // Строка
Перем _Аргументы; // Массив

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()
	_ЕдиницыРаботы = Новый Массив();
	_КоличествоОшибок = 0;
	_ОписаниеОшибки = "";
	_Аргументы = Новый Массив();
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура НастроитьОшибки(КоличествоОшибок, ОписаниеОшибки) Экспорт
	_КоличествоОшибок = КоличествоОшибок;
	_ОписаниеОшибки = ОписаниеОшибки;
КонецПроцедуры

Функция СохранитьИВернуть(ЕдиницаРаботы, Первый = Неопределено, Второй = Неопределено) Экспорт
	_ЕдиницыРаботы.Добавить(ЕдиницаРаботы);
	_Аргументы.Добавить(Первый);
	_Аргументы.Добавить(Второй);
	ЕдиницаРаботы.Сохранить(Новый СущностьРепозиторий());
	Если _ЕдиницыРаботы.Количество() <= _КоличествоОшибок Тогда
		ВызватьИсключение _ОписаниеОшибки;
	КонецЕсли;
	Возврат "результат транзакции";
КонецФункции

Функция ЕдиницаРаботы(Индекс) Экспорт
	Возврат _ЕдиницыРаботы[Индекс];
КонецФункции

Функция КоличествоПопыток() Экспорт
	Возврат _ЕдиницыРаботы.Количество();
КонецФункции

Функция Аргумент(Индекс) Экспорт
	Возврат _Аргументы[Индекс];
КонецФункции

#КонецОбласти
