Перем КодСостояния Экспорт; // Число
Перем _ТелоОтвета; // Структура

#Область ОбработчикиСобытий

// Создает успешный ответ GitHub с указанным телом.
//
// Параметры:
//   ТелоОтвета - Структура - Десериализованное тело ответа GraphQL.
Процедура ПриСозданииОбъекта(ТелоОтвета)
	КодСостояния = 200;
	_ТелоОтвета = ТелоОтвета;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает десериализованное тело ответа GraphQL.
//
// Возвращаемое значение:
//   Структура - Тело ответа.
Функция Json() Экспорт
	Возврат _ТелоОтвета;
КонецФункции

// Возвращает текст ответа.
//
// Возвращаемое значение:
//   Строка - Пустой текст успешного ответа.
Функция Текст() Экспорт
	Возврат "";
КонецФункции

#КонецОбласти
