Перем _КоличествоСообщений; // Число

#Область ОбработчикиСобытий

// Создает регистратор сообщений лога очереди.
Процедура ПриСозданииОбъекта()
	_КоличествоСообщений = 0;
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Регистрирует отладочное сообщение.
//
// Параметры:
//   Шаблон - Строка - Шаблон сообщения.
//   Параметр - Произвольный - Параметр шаблона.
Процедура Отладка(Шаблон, Параметр = Неопределено) Экспорт
	_КоличествоСообщений = _КоличествоСообщений + 1;
КонецПроцедуры

// Возвращает количество зарегистрированных сообщений.
//
// Возвращаемое значение:
//   Число - Количество сообщений.
Функция КоличествоСообщений() Экспорт
	Возврат _КоличествоСообщений;
КонецФункции

#КонецОбласти
