Перем _Порядок; // Массив
Перем _Ошибки; // Соответствие
Перем _КоличествоВызовов; // Соответствие

#Область ОбработчикиСобытий

Процедура ПриСозданииОбъекта()
	_Порядок = Новый Массив();
	_Ошибки = Новый Соответствие();
	_КоличествоВызовов = Новый Соответствие();
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Процедура НастроитьОшибку(Этап, Количество, Описание) Экспорт
	_Ошибки.Вставить(Этап, Новый Структура("Количество,Описание", Количество, Описание));
КонецПроцедуры

Функция ОтветитьНаНачало(ИнформацияОВызове) Экспорт
	Возврат ЗарегистрироватьИОтветить("BEGIN");
КонецФункции

Функция ОтветитьНаСохранение(ИнформацияОВызове) Экспорт
	Возврат ЗарегистрироватьИОтветить("CALLBACK");
КонецФункции

Функция ОтветитьНаФиксациюТранзакции(ИнформацияОВызове) Экспорт
	Возврат ЗарегистрироватьИОтветить("COMMIT");
КонецФункции

Функция ОтветитьНаОткатТранзакции(ИнформацияОВызове) Экспорт
	Возврат ЗарегистрироватьИОтветить("ROLLBACK");
КонецФункции

Функция ОтветитьНаЗакрытие(ИнформацияОВызове) Экспорт
	Возврат ЗарегистрироватьИОтветить("CLOSE");
КонецФункции

Функция Порядок() Экспорт
	Возврат СтрСоединить(_Порядок, ",");
КонецФункции

Функция Количество(Этап) Экспорт
	Результат = _КоличествоВызовов.Получить(Этап);
	Возврат ?(Результат = Неопределено, 0, Результат);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗарегистрироватьИОтветить(Этап)
	_Порядок.Добавить(Этап);
	Количество = Количество(Этап) + 1;
	_КоличествоВызовов.Вставить(Этап, Количество);
	Настройка = _Ошибки.Получить(Этап);
	Если Настройка <> Неопределено И Количество <= Настройка.Количество Тогда
		ВызватьИсключение Настройка.Описание;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

#КонецОбласти
