#Использовать entity
#Использовать collectionos
#Использовать autumn-logos
#Использовать "../../dto"
#Использовать "../../repository"

&Пластилин("КлиентGitHubAPI")
Перем _КлиентGitHubAPI; // КлиентGitHubAPI

&Пластилин("ХранилищеРепозиториев")
Перем _ХранилищеРепозиториев; // ХранилищеРепозиториев

&Лог("litros.ОбновляторРепозиториев")
Перем _Лог; // Лог

&Деталька(Значение = "litros.ИнтервалПроверкиАктуальности", ЗначениеПоУмолчанию = 300) 
Перем _ИнтервалПроверкиАктуальности; // Число

&Деталька(Значение = "litros.СрокАктуальностиРепозитория", ЗначениеПоУмолчанию = 604800) 
Перем _СрокАктуальностиРепозитория; // Число

&Желудь
&Прозвище("Сервис")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#Область ПрограммныйИнтерфейс

Процедура Запустить() Экспорт

	РазмерВыборки = 50;
	МиллисекундВСекунде = 1000;
	
	_Лог.Отладка("Запуск интервального обновления репозиториев");
	
	Пока Истина Цикл

		Попытка
			ОбновитьУстаревшиеРепозитории(РазмерВыборки);
		Исключение
			ТекстОшибки = СтрШаблон("Не удалось обновить репозитории: 
			|%1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			_Лог.Ошибка(ТекстОшибки);
		КонецПопытки;

		Приостановить(_ИнтервалПроверкиАктуальности * МиллисекундВСекунде);

	КонецЦикла;

КонецПроцедуры

Процедура ОбновитьРепозитории(ЗаданияНаОбновление) Экспорт

	Если ЗаданияНаОбновление.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ИдентификаторыУзлов = ПолучитьИдентификаторыУзлов(ЗаданияНаОбновление);
	_Лог.Отладка("Обновление репозиториев: %1", СтрСоединить(ИдентификаторыУзлов, ", "));

	УзлыРепозиториев = ПолучитьУзлыРепозиториевИзGitHub(ИдентификаторыУзлов);

	Если УзлыРепозиториев = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СохранитьРепозитории(ЗаданияНаОбновление, УзлыРепозиториев);

КонецПроцедуры

Процедура ОбновитьУстаревшиеРепозитории(РазмерВыборки) Экспорт
	
	ДатаОкончания = ТекущаяУниверсальнаяДата() - _СрокАктуальностиРепозитория;

	_Лог.Отладка("Запуск обновления репозиториев");
	
	ЗаданияНаОбновление = _ХранилищеРепозиториев.ПолучитьРепозиторииДляОбновления(ДатаОкончания, РазмерВыборки);
	ОбновитьРепозитории(ЗаданияНаОбновление);

	_Лог.Отладка("Завершение обновления репозиториев");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьИдентификаторыУзлов(ЗаданияНаОбновление)

	Результат = Новый Массив();
	Для Каждого Задание Из ЗаданияНаОбновление Цикл
		Результат.Добавить(Задание.ИдентификаторУзла);
	КонецЦикла;

	Возврат Результат;

КонецФункции

Функция ПолучитьУзлыРепозиториевИзGitHub(Идентификаторы)

	Ответ = ВыполнитьЗапросКGitHub(Идентификаторы);

	Если Ответ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Ответ.КодСостояния <> 200 Тогда
		_Лог.Ошибка("Ошибка при отправке запроса к GitHub: %1", Ответ.Текст());
		Возврат Неопределено;
	КонецЕсли;

	ДанныеОтвета = Ответ.Json();

	ОбработатьОшибкиGraphQL(ДанныеОтвета);

	Если Не ЗначениеЗаполнено(ДанныеОтвета["data"])
		Или Не ЗначениеЗаполнено(ДанныеОтвета["data"]["nodes"]) Тогда
		_Лог.Ошибка("Отсутствуют данные в ответе");
		Возврат Неопределено;
	КонецЕсли;

	Возврат ДанныеОтвета["data"]["nodes"];

КонецФункции

Функция ВыполнитьЗапросКGitHub(Идентификаторы)

	Переменные = Новый Структура("ids", Новый Массив());
	Для Каждого Идентификатор Из Идентификаторы Цикл
		Переменные["ids"].Добавить(Идентификатор);
	КонецЦикла;

	Попытка
		Ответ = _КлиентGitHubAPI.ВыполнитьGraphQL(
			ПодготовитьЗапросGraphQL(),
			Переменные
		);
	Исключение
		_Лог.Ошибка(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Неопределено;
	КонецПопытки;

	Возврат Ответ;

КонецФункции

Процедура СохранитьРепозитории(ЗаданияНаОбновление, УзлыРепозиториев)

	Для Индекс = 0 По УзлыРепозиториев.ВГраница() Цикл

		ДанныеРепозитория = УзлыРепозиториев[Индекс];
		Задание = ЗаданияНаОбновление[Индекс];

		СущностьРепозиторий = СоздатьСущностьРепозитория(ДанныеРепозитория, Задание.Идентификатор);

		Если СущностьРепозиторий = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		_ХранилищеРепозиториев.Сохранить(СущностьРепозиторий);

	КонецЦикла;

КонецПроцедуры

Функция СоздатьСущностьРепозитория(ДанныеРепозитория, ИсходныйИдентификатор)

	Если ДанныеРепозитория = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	ДанныеВладельца = ДанныеРепозитория["owner"];
	Если ДанныеВладельца = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	СущностьРепозиторий = Новый СущностьРепозиторий();
	СущностьРепозиторий.Идентификатор = ИсходныйИдентификатор;
	СущностьРепозиторий.ИдентификаторУзла = ДанныеРепозитория["id"];
	СущностьРепозиторий.Имя = ДанныеРепозитория["name"];
	СущностьРепозиторий.ПолноеИмя = СтрШаблон("%1/%2", ДанныеВладельца["login"], ДанныеРепозитория["name"]);
	СущностьРепозиторий.URL = ДанныеРепозитория["url"];
	СущностьРепозиторий.Владелец = ДанныеВладельца["login"];
	СущностьРепозиторий.Описание = ДанныеРепозитория["description"];
	СущностьРепозиторий.ЭтоФорк = ДанныеРепозитория["isFork"];
	СущностьРепозиторий.КоличествоЗвезд = ДанныеРепозитория["stargazerCount"];
	СущностьРепозиторий.КоличествоФорков = ДанныеРепозитория["forkCount"];

	Возврат СущностьРепозиторий;

КонецФункции

Функция ПодготовитьЗапросGraphQL()

	ТекстЗапроса = "query GetRepos($ids: [ID!]!){ 
	|	nodes(ids: $ids) {
	|		... on Repository {
	|			id
	|			name
	|			description
	|			url
	|			isFork
	|			stargazerCount
	|			forkCount
	|			owner {
	|				login
	|			}
	|		}
	|	}
	|}";

	Возврат ТекстЗапроса;

КонецФункции

Процедура ОбработатьОшибкиGraphQL(ДанныеОтвета)

	Если ДанныеОтвета["errors"] = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Ошибки = Новый Массив();

	Для Каждого Ошибка Из ДанныеОтвета["errors"] Цикл
		Ошибки.Добавить(Ошибка["message"]);
	КонецЦикла;

	ТекстОшибки = СтрСоединить(Ошибки, Символы.ПС);

	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		_Лог.Предупреждение(
			"Ошибки в ответе GraphQL: %1",
			ТекстОшибки
		);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
