#Использовать autumn-logos
#Использовать "../../db"

&Пластилин("ХранилищеОчередиПакетов")
Перем _ХранилищеОчередиПакетов; // ХранилищеОчередиПакетов

&Пластилин("ОбновляторЗависимыхРепозиториев")
Перем _ОбновляторЗависимыхРепозиториев; // ОбновляторЗависимыхРепозиториев

&Лог("litros.ПроцессорОчередиПакетов")
Перем _Лог; // Лог

&Деталька(Значение = "litros.ИнтервалОбработкиОчереди", ЗначениеПоУмолчанию = 60)
Перем _ИнтервалОбработкиОчереди; // Число

&Желудь
&Прозвище("Сервис")
Процедура ПриСозданииОбъекта()
КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Запускает непрерывную обработку очереди пакетами.
// Ошибка одного цикла регистрируется и не останавливает последующие циклы обработки.
Процедура Запустить() Экспорт

	РазмерВыборки = 10;

	_Лог.Отладка("Запуск обработки очереди пакетов");

	Пока Истина Цикл

		Попытка
			ОбработатьОднуПачку(РазмерВыборки);
		Исключение
			ТекстОшибки = СтрШаблон("Возникла ошибка при обработке очереди пакетов:
			|%1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			_Лог.Ошибка(ТекстОшибки);
		КонецПопытки;

		Приостановить(_ИнтервалОбработкиОчереди * 1000);

	КонецЦикла;

КонецПроцедуры

// Добавляет пакет в очередь, если он еще не поставлен на обработку.
//
// Параметры:
//   ИмяПакета - Строка - Имя добавляемого пакета.
Процедура ДобавитьВОчередь(Знач ИмяПакета) Экспорт

	ИмяПакета = РаботаСДаннымиБД.НормализироватьИмяПакета(ИмяПакета);
	ПакетДобавлен = _ХранилищеОчередиПакетов.Добавить(ИмяПакета);
	Если Не ПакетДобавлен Тогда
		Возврат;
	КонецЕсли;

	_Лог.Отладка("Пакет %1 добавлен в очередь", ИмяПакета);

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Получает и обрабатывает одну пачку очереди без ожидания следующего цикла.
//
// Параметры:
//   РазмерВыборки - Число - Максимальное количество элементов в пачке.
Процедура ОбработатьОднуПачку(РазмерВыборки) Экспорт

	ИменаПакетов = _ХранилищеОчередиПакетов.ПолучитьПачку(РазмерВыборки);
	Для Каждого ИмяПакета Из ИменаПакетов Цикл
		ОбработатьПакет(ИмяПакета);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьПакет(ИмяПакета)

	Успех = Ложь;

	Попытка
		Результат = _ОбновляторЗависимыхРепозиториев.ОбновитьПакет(ИмяПакета);
		Успех = Результат.Успех;
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось обновить статистику пакета '%1':
		|%2", ИмяПакета, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		_Лог.Ошибка(ТекстОшибки);
	КонецПопытки;

	Если Успех Тогда
		Попытка
			_ХранилищеОчередиПакетов.Удалить(ИмяПакета);
		Исключение
			ТекстОшибки = СтрШаблон("Не удалось удалить пакет '%1' из очереди:%2%3",
				ИмяПакета, Символы.ПС, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			_Лог.Ошибка(ТекстОшибки);
		КонецПопытки;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
